Repository: Renaud11232/Tonearm
Catalog: src/tonearm/bot/managers/translations/locales/*/LC_MESSAGES/messages.po
Languages: fr

source: Jump back to a specific track in the history
fr: Revenir à une piste précise de l'historique

source: track
fr: piste

source: Track number to jump back to
fr: Numéro de piste à laquelle revenir

source: Delete bot messages in the channel (up to 100 at once)
fr: Supprimer les messages du bot de ce salon (jusque 100 en une fois)

source: limit
fr: limite

source: Maximum number of messages to delete in one run
fr: Nombre maximum de messages à supprimer en une fois

source: Clear all tracks in the queue
fr: Enlever toutes les pistes de la file

source: Add a role or member to the DJs
fr: Ajouter un rôle ou membre aux DJs

source: Role or member to add to the DJs
fr: Rôle ou membre à ajouter aux DJs

source: Remove a role or member from the DJs
fr: Retirer un rôle ou membre des DJs

source: Role or member to remove from the DJs
fr: Rôle ou membre à retirer des DJs

source: Forward a specific amount of time into the track
fr: Avancer d'une durée spécifiée dans la piste

source: duration
fr: durée

source: How far to fast forward into the track
fr: Jusqu'où avancer dans la piste

source: Show the previously played tracks
fr: Montrer les pistes précédemment jouées

source: Page to display
fr: Page à afficher

source: Join your current voice channel
fr: Rejoindre le salon vocal dans lequel tu te trouves

source: Jump to a specific track in the queue
fr: Sauter jusqu'à une certaine piste de la file

source: Track number to jump to
fr: Numéro de piste jusqu'où sauter

source: Leave the current voice channel
fr: Quitter le salon vocal actuel

source: Set the loop mode of the current playback queue
fr: Définir le mode de boucle de la file actuelle

source: Loop mode to use
fr: Mode de boucle à utiliser

source: off
fr: désactivé

source: queue
fr: file

source: Change the position of a track in the queue
fr: Modifier la position d'une piste dans la file

source: from
fr: de

source: Initial track position
fr: Position initiale de la piste

source: to
fr: vers

source: Target track position
fr: Position désirée de la piste

source: Skip the current playing track to the next one
fr: Passer de la piste en cours de lecture à la suivante

source: Show the current playing track
fr: Montrer la piste en cours de lecture

source: Pause the currently playing track
fr: Mettre la piste en cours de lecture en pause

source: Play a track or playlist in your voice channel. You can provide link, or search for a track
fr: Jouer une piste ou une playlist dans ton salon vocal. Tu peux utiliser un lien, ou rechercher

source: query
fr: requête

source: Track or playlist to play. You can provide a link, or search for a track
fr: Piste ou playlist à jouer. Tu peux utiliser un lien, ou rechercher

source: Play the previous track from the queue
fr: Rejouer la piste précédente

source: Show the current queue
fr: Montrer la file

source: Remove a track from the queue
fr: Retirer une piste de la file

source: Track number to remove
fr: Numéro de piste à retirer

source: Resume the currently paused track
fr: Reprendre la lecture de la piste actuellement en pause

source: Rewind a specific amount of time into the track
fr: Rembobiner la piste d'une durée spécifiée

source: How far to rewind back into the track
fr: Jusqu'où rembobiner la piste

source: Seek to a specific time in the track
fr: Se déplacer à un moment précis dans la piste

source: Where to seek in the track
fr: Où se déplacer dans la piste

source: Set the text channel where this bot should be used
fr: Définir le salon textuel où ce bot devrait être utilisé

source: value
fr: valeur

source: Text channel where this bot should be used
fr: Salon textuel où ce bot devrait être utilisé

source: Enable anarchy mode, allowing everyone to use DJ commands
fr: Activer le mode anarchie, qui autorise n'importe qui à utiliser les commands de DJ

source: True to enable anarchy mode, False to disable it
fr: Vrai pour activer le mode anarchie, Faux pour le désactiver

source: True
fr: Vrai

source: False
fr: Faux

source: Enable automatic track announcements
fr: Activer les annonces automatiques de piste

source: True to enable automatic track announcements, False to disable them
fr: Vrai pour activer les annonces automatiques, Faux pour les désactiver

source: Reset the text channel where this bot should be used
fr: Réinitialiser le salon textuel où ce bot devait être utilisé

source: Reset anarchy mode, enabling back DJ enforcement
fr: Réinitialiser le mode anarchie, réactivant la vérification des DJs

source: Reset automatic track announcements, disabling them
fr: Réinitialiser les annonces de piste, les désactivant

source: Shuffle tracks in the queue
fr: Mélanger les pistes dans la file

source: Shut the bot down
fr: Éteindre le bot

source: Stop the current playback
fr: Arrêter la lecture en cours

source: Show nerdy details about the bot
fr: Montrer des détails de geek à sur le bot

source: Change the volume of the playing tracks
fr: Changer le volume de lecture des pistes

source: Playback volume (between 0 and 200)
fr: Volume de lecture (entre 0 et 200)

source: Vote to skip the current track
fr: Voter pour passer la piste actuelle

source: Rewinding to track {track}. Let’s bring it back !
fr: Retour à la piste {track}. En arrière toute !

source: My message is gone. It's like I was never here !
fr: Mon message s'est volatilisé. C'est comme si je n’avais jamais existé !

source: Wiped the queue. Sometimes starting fresh hits different.
fr: File vidée. Parfois, repartir de zéro, ça fait du bien.

source: Promoted {role_or_member} to DJ. Don’t scratch the vinyl !
fr: {role_or_member} a été promu au rang de DJ. Attention à ne pas rayer le vinyle !

source: Who needs intros anyway ?
fr: Qui a besoin d’intros, franchement ?

source: History
fr: Historique

source: Previous tracks
fr: Pistes précédentes

source: Played
fr: Jouées

source: Let's get this party started !
fr: Que la fête commence !

source: Boom. Skipped straight to track {track}. Enjoy !
fr: Boom. On passe direct à la piste {track}. Profite bien !

source: Mic dropped. I'm gone.
fr: Micro posé. Je disparais.

source: Looping turned off. One play, no reruns.
fr: Boucle désactivée. Une seule écoute, pas de rediffusion.

source: You must really love this one. Looping it on repeat.
fr: Tu dois vraiment l’adorer, celle-là. Allez, on la met en boucle.

source: Get ready for the encore. And the encore's encore. Looping the queue !
fr: Prépare-toi pour le rappel. Et le rappel du rappel. On boucle la file !

source: Shifted {track_title} like a playlist ninja. Moved from {from_} to {to}.
fr: {track_title} a glissé comme un ninja de la position {from_} à {to}.

source: Skipping the current track, I didn't like this one either.
fr: On zappe cette piste. Je n'étais pas fan non plus.

source: Now Playing
fr: En cours de lecture

source: Queued by
fr: Ajouté par

source: Playback paused. Take your time !
fr: Lecture mise en pause. Prends ton temps !

source: Added {track_title} to the queue ! This one’s gonna slap.
fr: {track_title} ajouté à la file ! Ça va envoyer du lourd.

source: Because one listen wasn’t enough...
fr: Parce qu’une écoute, ça ne suffisait pas...

source: I can't show you page {page} out of {max_pages}.
fr: Je ne peux pas te montrer la page {page} sur {max_pages}.

source: Nothing to show here
fr: Rien à montrer ici

source: {len_tracks} track
fr: {len_tracks} piste

source: {page} our of {max_pages}
fr: {page} sur {max_pages}

source: Up next :
fr: Ensuite :

source: In queue
fr: Dans la file

source: Say goodbye to {track_title}. It didn’t make the cut.
fr: Dis adieu à {track_title}. Elle ne faisait pas le poids.

source: Back in action ! Enjoy the tracks.
fr: De retour aux platines ! Faites-vous plaisir.

source: That part was worth a second listen !
fr: Cette partie valait bien une deuxième écoute !

source: Dropping the needle, classic move.
fr: Déposer l’aiguille, un classique.

source: All set ! {setting_name} is now {setting_value}.
fr: C’est bon ! {setting_name} est maintenant {setting_value}.

source: Boom ! {setting_name} is back to default: {setting_value}.
fr: Boom ! {setting_name} est revenu à sa valeur par défaut : {setting_value}.

source: Shuffled the queue. I hope you like surprises !
fr: File mélangée. J’espère que tu aimes les surprises !

source: Initiating shutdown sequence... it’s been an honor.
fr: Lancement de la séquence d’arrêt... ce fut un honneur.

source: Music stopped. The crowd goes silent.
fr: La musique s’arrête. Le public retient son souffle.

source: Version {version}, up and running !
fr: Version {version}, opérationnelle et prête !

source: Crafted with :heart: by {authors}.
fr: Construit avec :heart: par {authors}

source: Volume’s now {volume}%. Don’t blame me if it’s too loud !
fr: Volume réglé à {volume}%. Si c’est trop fort, c’est pas ma faute !

source: `{value}` is not a valid boolean value.
fr: `{value}` n'est pas une valeur booléenne valide.

source: `{value}` is not a valid duration.
fr: `{value}` n'est pas une durée valide.

source: `{value}` is not a valid loop mode.
fr: `{value}` n'est pas un mode de boucle valide.

source: `{value}` is not a valid locale.
fr: `{value}` n'est pas un langue valide.

source: Set the language to use on this server
fr: Définir la langue à utiliser sur ce serveur

source: Language to use on this server
fr: Langue à utiliser sur ce serveur

source: Reset the language to use on this server
fr: Réinitialiser la langue à utiliser sur ce serveur

source: I could not fetch the track, it looks like the URL you provided doesn't include a YouTube video ID.
fr: Je n'ai pas pu récupérer la piste, il semblerait que l'URL ne contient pas d'ID de vidéo YouTube.

source: I could not fetch the track, YouTube videos API returned error status : {error}
fr: Je n'ai pas pu récupérer la piste, l'API videos de YouTube a retourné le statut d'erreur : {error}

source: I could not fetch the playlist, YouTube playlistItems API returned error status : {error}
fr: Je n'ai pas pu récupérer la playlist, l'API playlistItems de YouTube a retourné le statut d'erreur : {error}

source: I could not load the track, it's hosted on a service I don't support.
fr: Je n'ai pas pu charger la piste, elle est hébergée sur un service que je ne supporte pas.

source: I could not load the track, I was unable to connect to the Cobalt API.
fr: Je n'ai pas pu charger la piste, je n'ai pas réussi à me connecter à l'API Cobalt.

source: I could not load the track, Cobalt API returned error : {error}
fr: Je n'ai pas pu charger la piste, l'API Cobalt a retourné l'erreur : {error}

source: I faced an unexpected error, please contact {owner}. I feel weird.
fr: J'ai rencontré une erreur inattendue, prenez contact avec {owner}. Je me sens bizarre.

source: Members of {role} are already DJs !
fr: Les membres de {role} sont déjà des DJs !

source: Members of {role} aren't DJs !
fr: Les membres de {role} ne sont pas des DJs !

source: {member} is already a DJ !
fr: {member} est déjà un DJ !

source: {member} isn't a DJ !
fr: {member} n'est pas un DJ !

source: I could not fetch the track, the provided URL does not point to an audio file.
fr: Je n'ai pas pu récupérer la piste, l'URL ne pointe pas vers un fichier audio.

source: I could not fetch the track, it's hosted on a service I don't support.
fr: Je n'ai pas pu récupérer la piste, elle est hébergée sur un service que je ne supporte pas.

source: I could not fetch the track, YouTube search API returned error status : {error}
fr: Je n'ai pas pu récupérer la piste, l'API search de YouTube a retourné le statut d'erreur : {error}

source: That’s too far back ! Even my buffer’s got limits.
fr: Là, tu vas trop loin dans le passé ! Même ma mémoire a ses limites.

source: I’d love to seek there, but the track isn't that long.
fr: J’aimerais bien aller jusque là, mais le morceau n’est pas aussi long.

source: I’d love to seek there, but it’s still downloading... patience, friend.
fr: J’aimerais bien aller jusque-là, mais ça télécharge encore... un peu de patience, l’ami.

source: Jump failed. That’s outside the queue’s bounds.
fr: Raté ! Cette piste n’existe pas dans la file.

source: That’s further back than my memory goes. Try a smaller number.
fr: Tu veux remonter plus loin que ma mémoire ! Essaie avec un nombre plus petit.

source: Oops ! Nothing to remove at that spot !
fr: Oups ! Rien à supprimer à cet endroit-là !

source: I couldn’t move anything. The queue only has {len_next_tracks} track(s).
fr: Je n’ai rien pu déplacer. Il n’y a que {len_next_tracks} morceau(x) dans la file.

source: You must join a voice channel first.
fr: Tu dois d’abord rejoindre un salon vocal.

source: I'm not in the same voice channel !
fr: On n’est pas dans le même salon vocal !

source: I'm not currently playing any track.
fr: Je ne joue aucune piste pour le moment.

source: I've already joined a voice channel.
fr: Je suis déjà dans un salon vocal.

source: Already paused. No need to rush.
fr: C’est déjà en pause. Pas besoin de se précipiter.

source: The music never really stopped.
fr: La musique ne s'est jamais vraiment arrêtée.

source: The queue is empty, what can I do ?
fr: La file est vide, que puis-je faire ?

source: I can't do that with no track in the history.
fr: Je ne peux pas faire cela sans aucune piste dans l'historique.

source: I got abruptly disconnected, ask me again in {remaining_seconds} second(s).
fr: J’ai été déconnecté brutalement, réessaie dans {remaining_seconds} seconde(s).

source: No playable track were found !
fr: Aucune piste jouable trouvée !

source: You don't have the permission to use this command.
fr: Tu n'as pas le droit d'utiliser cette commande.

source: Anarchy rules here, votes are disabled !
fr: Ici, c’est l’anarchie, les votes sont désactivés !

source: I'm only accepting commands in the {channel} channel.
fr: Je n’accepte les commandes que dans le salon {channel}.
